---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPathType.ArrowheadTypeId
source: html/3c6c3cb9-9fa0-ecbf-c6a3-1ef77d783708.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathType.ArrowheadTypeId Property

The arrow head type of the stairs path.

## Syntax (C#)
```csharp
public ElementId ArrowheadTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The arrowheadTypeId is not a valid arrow head type.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null